--简单来讲，子查询就是一个select中嵌套了一个select
--子查询效率比较低
--标量子查询
    --查询身高最高的男生
    select max(height) from studuent;
        +-------------+
        | max(height) |
        +-------------+
        |      190.00 |
        +-------------+
        1 row in set (0.00 sec)

    select * from studuent where height = (select max(height) from studuent);
        +----+--------+------+--------+--------+--------+-----------+
        | id | name   | age  | height | gender | cls_id | is_delete |
        +----+--------+------+--------+--------+--------+-----------+
        | 13 | 小五   |   13 | 190.00 | 女     |      3 |           |
        +----+--------+------+--------+--------+--------+-----------+
        1 row in set (0.00 sec)

    --利用子查询解决自关联查询中的问题
        select * from areas where pid = (select aid from areas where atitle = "陕西");
            +-----+------+--------+-------+
            | aid | pid  | atitle | types |
            +-----+------+--------+-------+
            | 311 |   24 | 西安   |     2 |
            | 312 |   24 | 安康   |     2 |
            | 313 |   24 | 宝鸡   |     2 |
            | 314 |   24 | 汉中   |     2 |
            | 315 |   24 | 商洛   |     2 |
            | 316 |   24 | 铜川   |     2 |
            | 317 |   24 | 渭南   |     2 |
            | 318 |   24 | 咸阳   |     2 |
            | 319 |   24 | 延安   |     2 |
            | 320 |   24 | 榆林   |     2 |
            +-----+------+--------+-------+
            10 rows in set (0.00 sec)


--列级子查询
    --  查询学生的班级号能够对应的学生信息
