#导入earas.sql文件中的数据
    #从earas.sql文件目录下登录数据库,使用source earas.sql导入数据

# 一个表中的一列关联到该表中的另一列：自关联
# 使用：省市关联、行政关系等

create table areas(
    aid int primary key,
    pid int,
    atitle varchar(20),
    types tinyint(1) default "2"
);


# 查看省份
select * from areas where pid = 1;


# 查看省份市的个数
select * from areas where atitle = '陕西';
    +-----+------+--------+-------+
    | aid | pid  | atitle | types |
    +-----+------+--------+-------+
    |  24 |    1 | 陕西   |     1 |
    +-----+------+--------+-------+
    1 row in set (0.00 sec)

select * from areas where pid = 24;
    +-----+------+--------+-------+
    | aid | pid  | atitle | types |
    +-----+------+--------+-------+
    | 311 |   24 | 西安   |     2 |
    | 312 |   24 | 安康   |     2 |
    | 313 |   24 | 宝鸡   |     2 |
    | 314 |   24 | 汉中   |     2 |
    | 315 |   24 | 商洛   |     2 |
    | 316 |   24 | 铜川   |     2 |
    | 317 |   24 | 渭南   |     2 |
    | 318 |   24 | 咸阳   |     2 |
    | 319 |   24 | 延安   |     2 |
    | 320 |   24 | 榆林   |     2 |
    +-----+------+--------+-------+
    10 rows in set (0.00 sec)

select * from areas where pid = 311;
    +------+------+-----------+-------+
    | aid  | pid  | atitle    | types |
    +------+------+-----------+-------+
    | 2596 |  311 | 莲湖区    |     3 |
    | 2597 |  311 | 新城区    |     3 |
    | 2598 |  311 | 碑林区    |     3 |
    | 2599 |  311 | 雁塔区    |     3 |
    | 2600 |  311 | 灞桥区    |     3 |
    | 2601 |  311 | 未央区    |     3 |
    | 2602 |  311 | 阎良区    |     3 |
    | 2603 |  311 | 临潼区    |     3 |
    | 2604 |  311 | 长安区    |     3 |
    | 2605 |  311 | 蓝田县    |     3 |
    | 2606 |  311 | 周至县    |     3 |
    | 2607 |  311 | 户县      |     3 |
    | 2608 |  311 | 高陵县    |     3 |
    +------+------+-----------+-------+
    13 rows in set (0.01 sec)


# 另一种查询方法(假如有两章表的情况下，一张省份表，一张地级市表的情况下，地级市的pid = 省份表的aid)
# 思路：可以通过as生成新的表
select * from areas as province inner join areas as city on province.aid = city.pid having province.atitle = "陕西";
select province.atitle, city.atitle from areas as province inner join areas as city on city.pid = province.aid having province.atitle = "陕西";

    +-----+------+--------+-------+-----+------+--------+-------+
    | aid | pid  | atitle | types | aid | pid  | atitle | types |
    +-----+------+--------+-------+-----+------+--------+-------+
    |  24 |    1 | 陕西   |     1 | 311 |   24 | 西安   |     2 |
    |  24 |    1 | 陕西   |     1 | 312 |   24 | 安康   |     2 |
    |  24 |    1 | 陕西   |     1 | 313 |   24 | 宝鸡   |     2 |
    |  24 |    1 | 陕西   |     1 | 314 |   24 | 汉中   |     2 |
    |  24 |    1 | 陕西   |     1 | 315 |   24 | 商洛   |     2 |
    |  24 |    1 | 陕西   |     1 | 316 |   24 | 铜川   |     2 |
    |  24 |    1 | 陕西   |     1 | 317 |   24 | 渭南   |     2 |
    |  24 |    1 | 陕西   |     1 | 318 |   24 | 咸阳   |     2 |
    |  24 |    1 | 陕西   |     1 | 319 |   24 | 延安   |     2 |
    |  24 |    1 | 陕西   |     1 | 320 |   24 | 榆林   |     2 |
    +-----+------+--------+-------+-----+------+--------+-------+
    10 rows in set (0.01 sec)


select * from areas as province inner join areas as city on city.pid = province.aid having province.atitle = "西安";
    +-----+------+--------+-------+------+------+-----------+-------+
    | aid | pid  | atitle | types | aid  | pid  | atitle    | types |
    +-----+------+--------+-------+------+------+-----------+-------+
    | 311 |   24 | 西安   |     2 | 2596 |  311 | 莲湖区    |     3 |
    | 311 |   24 | 西安   |     2 | 2597 |  311 | 新城区    |     3 |
    | 311 |   24 | 西安   |     2 | 2598 |  311 | 碑林区    |     3 |
    | 311 |   24 | 西安   |     2 | 2599 |  311 | 雁塔区    |     3 |
    | 311 |   24 | 西安   |     2 | 2600 |  311 | 灞桥区    |     3 |
    | 311 |   24 | 西安   |     2 | 2601 |  311 | 未央区    |     3 |
    | 311 |   24 | 西安   |     2 | 2602 |  311 | 阎良区    |     3 |
    | 311 |   24 | 西安   |     2 | 2603 |  311 | 临潼区    |     3 |
    | 311 |   24 | 西安   |     2 | 2604 |  311 | 长安区    |     3 |
    | 311 |   24 | 西安   |     2 | 2605 |  311 | 蓝田县    |     3 |
    | 311 |   24 | 西安   |     2 | 2606 |  311 | 周至县    |     3 |
    | 311 |   24 | 西安   |     2 | 2607 |  311 | 户县      |     3 |
    | 311 |   24 | 西安   |     2 | 2608 |  311 | 高陵县    |     3 |
    +-----+------+--------+-------+------+------+-----------+-------+
    13 rows in set (0.01 sec)